{"config": {"name": "model_1", "output_layers": [["pred", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 256, 256, 3], "dtype": "float32"}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "data_format": "channels_last", "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "activity_regularizer": null, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "strides": [1, 1], "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "filters": 64}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"name": "conv2d_2", "data_format": "channels_last", "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "activity_regularizer": null, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "strides": [1, 1], "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "filters": 64}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"name": "conv2d_3", "data_format": "channels_last", "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "activity_regularizer": null, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "strides": [1, 1], "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "filters": 64}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"name": "conv2d_4", "data_format": "channels_last", "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "activity_regularizer": null, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "strides": [1, 1], "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "filters": 64}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"name": "conv2d_5", "data_format": "channels_last", "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "activity_regularizer": null, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "strides": [1, 1], "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "filters": 64}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"name": "conv2d_6", "data_format": "channels_last", "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "activity_regularizer": null, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "strides": [1, 1], "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "filters": 64}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6", "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"name": "conv2d_7", "data_format": "channels_last", "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "activity_regularizer": null, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "strides": [1, 1], "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "filters": 64}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_7", "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"name": "conv2d_8", "data_format": "channels_last", "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "activity_regularizer": null, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "strides": [1, 1], "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "filters": 64}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_8", "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "up_sampling2d_1", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "size": [2, 2], "data_format": "channels_last", "trainable": true, "interpolation": "nearest"}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["activation_6", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"name": "conv2d_9", "data_format": "channels_last", "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "activity_regularizer": null, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "strides": [1, 1], "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "filters": 64}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_9", "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"name": "conv2d_10", "data_format": "channels_last", "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "activity_regularizer": null, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "strides": [1, 1], "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "filters": 64}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_10", "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "up_sampling2d_2", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "size": [2, 2], "data_format": "channels_last", "trainable": true, "interpolation": "nearest"}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["activation_4", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"name": "conv2d_11", "data_format": "channels_last", "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "activity_regularizer": null, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "strides": [1, 1], "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "filters": 64}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_11", "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"name": "conv2d_12", "data_format": "channels_last", "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "activity_regularizer": null, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "strides": [1, 1], "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "filters": 64}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_12", "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"name": "up_sampling2d_3", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_3", "size": [2, 2], "data_format": "channels_last", "trainable": true, "interpolation": "nearest"}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"name": "concatenate_3", "class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}], ["activation_2", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"name": "conv2d_13", "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "filters": 64}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "momentum": 0.99, "center": true, "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_13", "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"name": "pred", "class_name": "Conv2D", "config": {"name": "pred", "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "filters": 1}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.4"}