{"class_name": "Model", "backend": "tensorflow", "config": {"output_layers": [["activation_7_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 256, 256, 3], "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"filters": 64, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_constraint": null, "name": "conv2d_1", "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "linear"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"name": "batch_normalization_1", "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"trainable": false, "name": "activation_1", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"filters": 64, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_constraint": null, "name": "conv2d_2", "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "linear"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"name": "batch_normalization_2", "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"trainable": false, "name": "activation_2", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "trainable": false, "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"filters": 64, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_constraint": null, "name": "conv2d_3", "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "linear"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"name": "batch_normalization_3", "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"trainable": false, "name": "activation_3", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"filters": 64, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_constraint": null, "name": "conv2d_4", "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "linear"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"name": "batch_normalization_4", "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_4", "config": {"trainable": false, "name": "activation_4", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "trainable": false, "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"filters": 64, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_constraint": null, "name": "conv2d_5", "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "linear"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"name": "batch_normalization_5", "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"trainable": false, "name": "activation_5", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"filters": 64, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_constraint": null, "name": "conv2d_6", "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "linear"}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"name": "batch_normalization_6", "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_6", "config": {"trainable": false, "name": "activation_6", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_last", "trainable": false, "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"filters": 64, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_constraint": null, "name": "conv2d_7", "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "linear"}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"name": "batch_normalization_7", "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_7", "config": {"trainable": false, "name": "activation_7", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"filters": 64, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_constraint": null, "name": "conv2d_8", "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "linear"}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"name": "batch_normalization_8", "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_8", "config": {"trainable": false, "name": "activation_8", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_1", "config": {"trainable": false, "name": "up_sampling2d_1", "interpolation": "nearest", "data_format": "channels_last", "size": [2, 2]}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_1", "config": {"trainable": false, "name": "concatenate_1", "axis": -1}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["activation_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"filters": 64, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_constraint": null, "name": "conv2d_9", "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "linear"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"name": "batch_normalization_9", "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_9", "config": {"trainable": false, "name": "activation_9", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_10", "config": {"filters": 64, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_constraint": null, "name": "conv2d_10", "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "linear"}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"name": "batch_normalization_10", "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_10", "config": {"trainable": false, "name": "activation_10", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_2", "config": {"trainable": false, "name": "up_sampling2d_2", "interpolation": "nearest", "data_format": "channels_last", "size": [2, 2]}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "InputLayer", "name": "Input", "config": {"sparse": false, "name": "Input", "batch_input_shape": [null, 256, 256, 3], "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Concatenate", "name": "concatenate_2", "config": {"trainable": false, "name": "concatenate_2", "axis": -1}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["activation_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "Encode_Layer1", "config": {"filters": 16, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "name": "Encode_Layer1", "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "relu"}, "inbound_nodes": [[["Input", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_11", "config": {"filters": 64, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_constraint": null, "name": "conv2d_11", "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "linear"}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "Encode_Layer2", "config": {"name": "Encode_Layer2", "pool_size": [2, 2], "data_format": "channels_last", "trainable": false, "strides": [2, 2], "padding": "same"}, "inbound_nodes": [[["Encode_Layer1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"name": "batch_normalization_11", "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "Encode_Layer3", "config": {"filters": 16, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "name": "Encode_Layer3", "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "relu"}, "inbound_nodes": [[["Encode_Layer2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_11", "config": {"trainable": false, "name": "activation_11", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "Encode_Layer4", "config": {"name": "Encode_Layer4", "pool_size": [2, 2], "data_format": "channels_last", "trainable": false, "strides": [2, 2], "padding": "same"}, "inbound_nodes": [[["Encode_Layer3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_12", "config": {"filters": 64, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "kernel_constraint": null, "name": "conv2d_12", "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "linear"}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "Encode_Layer5", "config": {"filters": 16, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "name": "Encode_Layer5", "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "relu"}, "inbound_nodes": [[["Encode_Layer4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"name": "batch_normalization_12", "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "Encode_Layer6", "config": {"name": "Encode_Layer6", "pool_size": [2, 2], "data_format": "channels_last", "trainable": false, "strides": [2, 2], "padding": "same"}, "inbound_nodes": [[["Encode_Layer5", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_12", "config": {"trainable": false, "name": "activation_12", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "Decode_Layer1", "config": {"filters": 16, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "name": "Decode_Layer1", "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "relu"}, "inbound_nodes": [[["Encode_Layer6", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_3", "config": {"trainable": false, "name": "up_sampling2d_3", "interpolation": "nearest", "data_format": "channels_last", "size": [2, 2]}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "Decode_Layer2", "config": {"trainable": false, "name": "Decode_Layer2", "interpolation": "nearest", "data_format": "channels_last", "size": [2, 2]}, "inbound_nodes": [[["Decode_Layer1", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_3", "config": {"trainable": false, "name": "concatenate_3", "axis": -1}, "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}], ["activation_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "Decode_Layer3", "config": {"filters": 16, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "name": "Decode_Layer3", "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "relu"}, "inbound_nodes": [[["Decode_Layer2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_13", "config": {"filters": 64, "bias_regularizer": null, "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_13", "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "linear"}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "Decode_Layer4", "config": {"trainable": false, "name": "Decode_Layer4", "interpolation": "nearest", "data_format": "channels_last", "size": [2, 2]}, "inbound_nodes": [[["Decode_Layer3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"name": "batch_normalization_13", "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "Decode_Layer5", "config": {"filters": 16, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "name": "Decode_Layer5", "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "relu"}, "inbound_nodes": [[["Decode_Layer4", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_13", "config": {"trainable": false, "name": "activation_13", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "Decode_Layer6", "config": {"trainable": false, "name": "Decode_Layer6", "interpolation": "nearest", "data_format": "channels_last", "size": [2, 2]}, "inbound_nodes": [[["Decode_Layer5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "pred", "config": {"filters": 1, "bias_regularizer": null, "kernel_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "name": "pred", "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [1, 1], "activation": "linear"}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "Output", "config": {"filters": 1, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "name": "Output", "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "relu"}, "inbound_nodes": [[["Decode_Layer6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "input1_batch_normalization_14", "config": {"name": "input1_batch_normalization_14", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["pred", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "input2_batch_normalization_14", "config": {"name": "input2_batch_normalization_14", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["Output", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "input1_conv2d_14", "config": {"filters": 64, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "kernel_constraint": null, "name": "input1_conv2d_14", "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "linear"}, "inbound_nodes": [[["input1_batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "input2_conv2d_14", "config": {"filters": 64, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "kernel_constraint": null, "name": "input2_conv2d_14", "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "linear"}, "inbound_nodes": [[["input2_batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concat_features", "config": {"trainable": true, "name": "concat_features", "axis": -1}, "inbound_nodes": [[["input1_conv2d_14", 0, 0, {}], ["input2_conv2d_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"name": "batch_normalization_14", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["concat_features", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block1_1", "config": {"filters": 64, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "name": "block1_1", "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "linear"}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "activation_18", "config": {"trainable": true, "name": "activation_18", "alpha": 0.10000000149011612}, "inbound_nodes": [[["block1_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1_1", "config": {"name": "max_pooling2d_1_1", "pool_size": [28, 28], "data_format": "channels_last", "trainable": true, "strides": [4, 4], "padding": "valid"}, "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2_1", "config": {"name": "batch_normalization_2_1", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["max_pooling2d_1_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_1", "config": {"filters": 32, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "name": "block2_1", "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activation": "linear"}, "inbound_nodes": [[["batch_normalization_2_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "activation_2_1", "config": {"trainable": true, "name": "activation_2_1", "alpha": 0.10000000149011612}, "inbound_nodes": [[["block2_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2_1", "config": {"name": "max_pooling2d_2_1", "pool_size": [7, 7], "data_format": "channels_last", "trainable": true, "strides": [4, 4], "padding": "valid"}, "inbound_nodes": [[["activation_2_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4_1", "config": {"name": "batch_normalization_4_1", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["max_pooling2d_2_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "units": 4096, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["batch_normalization_4_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "activation_4_1", "config": {"trainable": true, "name": "activation_4_1", "alpha": 0.10000000149011612}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_4_1", "config": {"name": "max_pooling2d_4_1", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["activation_4_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_5_1", "config": {"name": "batch_normalization_5_1", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["max_pooling2d_4_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "units": 32, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["batch_normalization_5_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "activation_5_1", "config": {"trainable": true, "name": "activation_5_1", "alpha": 0.10000000149011612}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_5_1", "config": {"name": "max_pooling2d_5_1", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["activation_5_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_6_1", "config": {"name": "batch_normalization_6_1", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["max_pooling2d_5_1", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_6_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "units": 1, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "activation": "linear"}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "activation_7_1", "config": {"trainable": true, "name": "activation_7_1", "alpha": 0.10000000149011612}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["Input", 0, 0]]}, "keras_version": "2.2.4"}